# FilterNumericGreater Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericGreater Class
Members See Also
---
Tests whether numeric values from the document are greater than a certain value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterNumericGreater : FilterNumericRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterNumericGreater _
	Inherits FilterNumericRuleEvaluator
```

Visual C++
---
```text
public ref class FilterNumericGreater : public FilterNumericRuleEvaluator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterNumericRuleEvaluator Autodesk.Revit.DB..::..FilterNumericGreater
# See Also
FilterNumericGreater Members
Autodesk.Revit.DB Namespace